[
  {
    "heading": "Modelberry blue",
    "abstract": "A user interface library.",
    "icon": "globe"
  },
  {
    "heading": "Contact",
    "abstract": "Get in touch.",
    "icon": "phone",
    "variant": "headline"
  },
  {
    "heading": "Profile",
    "abstract": "About Jacco Meijer.",
    "icon": "user",
    "variant": "profile"
  },
  {
    "heading": "Assignments",
    "abstract": "Recent full-time assignments within a team.",
    "icon": "clipboard",
    "variant": "headline"
  },
  {
    "heading": "―Merel Kamp",
    "abstract": "\"Alsof je werk bepaalt wie je bent, laat staan wat je passie is.\"",
    "variant": "quote"
  },
  {
    "heading": "Projects",
    "abstract": "Personal projects.",
    "icon": "briefcase",
    "variant": "headline"
  },
  {
    "heading": "@jaccomeijer/jmmake",
    "abstract": "Node build tool for npm packages in a git repository. Npm 7 workspaces are supported. Heavy lifting is done by the @npmcli/arborist package.",
    "icon": "package"
  },
  {
    "heading": "@jaccomeijer/oauth2-grants",
    "abstract": "Library for handling OAuth 2 auth requests with Express.",
    "icon": "package"
  },
  {
    "heading": "Jacco Meijer on LinkedIn",
    "icon": "linkedin"
  },
  {
    "heading": "jacco@jaccomeijer.nl",
    "icon": "mail"
  },
  {
    "heading": "Business market webshop for KPN",
    "abstract": "Develop a new omni channel webshop for KPN business market.",
    "icon": "clipboard",
    "variant": "headline"
  },
  {
    "heading": "Health care self service platform for Healthtrain",
    "abstract": "Setup technical architecture for a new self service platform.",
    "icon": "clipboard",
    "variant": "headline"
  },
  {
    "heading": "Modelberry",
    "abstract": "Sync Typescript to Contentful. Two way. Models and content.\n\nAlong with a user interface library that emerged developing the factory.",
    "icon": "box"
  },
  {
    "heading": "―Kay Waardenburg, Scrum Master",
    "abstract": "\"As a Scrum master I worked with Jacco during the first and second wave of Covid at KPN. He was of essential value to the project as a developer. Moreover, in the remote working situation he showed his skill in self-organising and independent thinking on Agile approaches in addition to the technical solutions he provided in this greenfield project!\"",
    "icon": "message-circle",
    "variant": "quote"
  },
  {
    "heading": "―Martijn de Way, Digital Strategy Consultant",
    "abstract": "\"As a PO I worked together with Jacco at KPN. In this time Jacco showed he was capable of raising the level of development. He introduced atomic design and delivered excellent quality. He is keen to challenge the status-quo and is always looking for ways to improve, both in process as technology. Jacco is equipped with years of experience and has ideas on how to handle every challenge we faced him with. He is very knowledgeable and knows the newest developments in the IT landscape. He is a great addition to a team and always ready to help and bring in new ideas.\"",
    "icon": "message-circle",
    "variant": "quote"
  },
  {
    "heading": "―Romé van Grinsven, Frontend Developer",
    "abstract": "\"As a javascript dev I worked alongside Jacco at KPN. I particularly liked how Jacco keeps overview. He is able to break up complex tasks into simple tasks and communicates this clearly. Our sparring sessions kept both our coding skills up to date. Overall, I enjoyed working together!\"",
    "icon": "message-circle",
    "variant": "quote"
  },
  {
    "heading": "―Diego Chavez, Sr. Software Engineer",
    "abstract": "\"Jacco is a talented and enthusiastic developer. He is proactive and definitely a great leader, that takes ownership of the projects. He has a strong knowledge of software architecture and infrastructure, that been said he is a great contributor to any type of project to reach mature levels and grow.\n\nHe shared with the team a lot of knowledge on creating standardized processes, using Vue and Nuxt, Storybook also created a space for clarity on the process of bringing designs to real applications.\n\nJacco is a passionate software developer you can just check his GitHub projects and will have a glimpse of his great skills.\n\nI recommend Jacco for projects that want to excel, he is always looking for creating good documentation and a clean codebase, improving, and create highly reusable code.\"",
    "icon": "message-circle",
    "variant": "quote"
  },
  {
    "heading": "Interactive Infographic for Simyo",
    "abstract": "Develop a landing page with interactive animations.",
    "icon": "clipboard",
    "variant": "headline"
  },
  {
    "heading": "Modelberry",
    "abstract": "On data modeling and software architecture.",
    "icon": "package",
    "variant": "card"
  },
  {
    "heading": "―Marijn S., Product owner",
    "abstract": "\"Jacco did an excellent job in setting up a modular and future proof architecture for our new self service health care platform.\"",
    "icon": "message-circle",
    "variant": "quote"
  },
  {
    "heading": "Patient monitoring backend for Goal 3",
    "abstract": "Refactor NodeJs MQTT server for medical bedside monitor using NodeJs best practices.",
    "icon": "clipboard",
    "variant": "headline"
  },
  {
    "heading": "Electronic Health Record system",
    "abstract": " Feasibility study on a new solution for an old problem.",
    "icon": "clipboard",
    "variant": "headline"
  },
  {
    "heading": "Thinkwise frontend features",
    "abstract": "Getting the Thinkwise React GUI feature complete.",
    "icon": "clipboard",
    "variant": "headline"
  },
  {
    "heading": "―Martijn S., Senior Frontend Developer",
    "abstract": "“Wij hebben Jacco leren kennen als een vakbekwaam en enthousiast persoon. Met zijn humor en vaardigheden hebben we hier een mooi product binnen de daarvoor gestelde termijn af kunnen leveren. Als hem al iets vreemds was, heeft hij er geen enkele moeite mee zich ook in deze vaardigheden te verdiepen.”",
    "icon": "message-circle",
    "variant": "quote"
  },
  {
    "heading": "―Erik T., Senior frontend developer",
    "abstract": "\"flexibel en werkt graag op locatie\", \"snelle inschatting van de kwaliteit van bestaande code\", “heel blij met je inzichten en aanbevelingen\"",
    "icon": "message-circle",
    "variant": "quote"
  },
  {
    "heading": "Typescript interface for React UI components",
    "abstract": "How to define an interface for React UI components that prevents breaking changes.",
    "icon": "message-circle",
    "variant": "headline"
  },
  {
    "heading": "About",
    "abstract": "First there was Wheelroom. Then came the UI Library. This evolved into the Modelberry factory as we know it.",
    "icon": "user",
    "variant": "headline"
  },
  {
    "heading": "Open source",
    "abstract": "Mbfactory is free to use and open source.",
    "icon": "github",
    "variant": "card"
  },
  {
    "heading": "TSDoc",
    "abstract": "Mbfactory uses TSDoc tags to annotate typescript interfaces. The same tags you use to generate documentation.",
    "icon": "tag",
    "variant": "card"
  },
  {
    "heading": "@modelberry/css-theme",
    "abstract": "Library for working with css theme variables.",
    "icon": "package",
    "variant": "block"
  },
  {
    "heading": "What happened to Wheelroom?",
    "abstract": "Founded in 2018. Started to fly in 2020 and abandoned in 2021. What happened?",
    "icon": "message-circle",
    "variant": "headline"
  },
  {
    "heading": "Contentful, Netlify and Gatsby four years later",
    "abstract": "What did we learn from using Contentful for four years?",
    "icon": "message-circle",
    "variant": "headline"
  },
  {
    "heading": "React component themes and CSS variables",
    "abstract": "Creating React components with flexible themes by using CSS variables.",
    "icon": "message-circle",
    "variant": "headline"
  },
  {
    "heading": "―Zen of Python",
    "abstract": "\"Explicit is better than implicit\"",
    "icon": "message-square",
    "variant": "quote"
  },
  {
    "heading": "Naming React components",
    "abstract": "What's in a name? A clear naming strategy helps developers communicate. Most devs rather spend time writing component code than wasting time on a good component name.",
    "icon": "message-circle",
    "variant": "headline"
  },
  {
    "heading": "Agile Scrum",
    "abstract": "The Agile Scrum framework is flexible enough to be used in many different ways. Here's one way of working.",
    "icon": "message-circle",
    "variant": "headline"
  },
  {
    "heading": "On Javascript transpilers, bundlers and modules",
    "abstract": "There's Javascript transpilers, modules, bundles and bundlers. This is a brief overview of all of these.",
    "icon": "message-circle",
    "variant": "headline"
  },
  {
    "heading": "Javascript history",
    "abstract": "In 1986 David Ungar and Randall B. Smith developed Self at Xerox PARC. Inspired by Java, Scheme and Self Brendan Eich created Javascript in 1995.",
    "icon": "message-circle",
    "variant": "headline"
  },
  {
    "heading": "Documentation",
    "abstract": "Documenting a software project is challenging. Here's a few simple guidelines that help a team writing clear documentation.",
    "icon": "message-circle",
    "variant": "headline"
  },
  {
    "heading": "Content modeling with variants",
    "abstract": "The efficiency of a variant field in a content model.",
    "icon": "message-circle",
    "variant": "headline"
  },
  {
    "heading": "Handling complex projects",
    "abstract": "This diagram became known as the *Stacey Matrix* and has been frequently adapted by other writers, often in ways not consistent with Stacey's original.",
    "variant": "media"
  },
  {
    "heading": "Versioning strategy for npm modules",
    "abstract": "It is important to be able to bump the version of a npm package without side effects.",
    "icon": "message-circle",
    "variant": "headline"
  },
  {
    "heading": "NPM7 and @npmcli/arborist",
    "abstract": "@npmcli/arborist is a powerful library that handles the new npm 7 workspaces. This blog is about a simple make tool that uses the library.",
    "icon": "message-circle",
    "variant": "headline"
  },
  {
    "heading": "Split modules",
    "abstract": "Split up a module into submodules as soon as the module becomes too hard to update.",
    "icon": "check-circle",
    "variant": "quote"
  },
  {
    "heading": "facebook/create-react-app",
    "abstract": "Create React App is a comfortable environment for learning React, and is the best way to start building a new single-page application in React.",
    "icon": "github",
    "variant": "card"
  },
  {
    "heading": "Use a monorepo",
    "abstract": "Use a monorepo to make sure the latest component also has the latest version.",
    "icon": "check-circle",
    "variant": "quote"
  },
  {
    "heading": "Comparing React app, Nextjs and Gatsby",
    "abstract": "A new React project starts with a React toolchain. Main tools in the chains are SSR, React server components and GraphQL.",
    "icon": "message-square",
    "variant": "headline"
  },
  {
    "heading": "Blog",
    "abstract": "On cyber security and software architecture.",
    "icon": "message-circle",
    "variant": "headline"
  }
]
